app/views/reservations/index.html.erb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        <% @reservations.each do |reservation| %>
          <% room = Room.find_by(id: reservation.room_id) %>