app/views/rooms/index.html.erb

SELECT "rooms".* FROM "rooms"
---
            <td>
              <% if room.room_image.blank? %>