app/views/rooms/search.html.erb

        <p class="Room__name">
          <% if room.room_image.blank? %>
---
SELECT "rooms".* FROM "rooms" WHERE (room_name LIKE '%東京%' OR content LIKE '%東京%')