app/controllers/reservations_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def confirm

    @room = Room.find(params[:reservation][:room_id])

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "reservations" ("created_at", "updated_at", "start_date", "end_date", "days", "person_num", "total_price", "user_id", "room_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @room = Room.find(params[:reservation][:room_id])
    @reservation = Reservation.new(params.require(:reservation).permit(:start_date, :end_date, :person_num, :room_id, :user_id, :days, :total_price))  #  ●モデルに定義するのこれでいいのか？モデルの定義必要なカラムとSQLの書き方とlikeテーブル
    if params[:back] || !@reservation.save

SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 271], ["LIMIT", 1]]
---
  def show
    @reservation = Reservation.find(params[:room_id])

SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 271], ["LIMIT", 1]]
---
  def edit
    @reservation = Reservation.find(params[:id])