app/controllers/rooms_controller.rb

  def create
    @room = Room.new(params.require(:room).permit(:room_image, :room_name, :content, :price, :address))

    if @room.save
---
INSERT INTO "rooms" ("room_name", "content", "price", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["room_name", "帝国ホテル"], ["content", "あ"], ["price", ""], ["address", "〒 100-8558 東京都千代田区内幸町1-1-1"], ["created_at", "2023-10-18 14:13:41.370655"], ["updated_at", "2023-10-18 14:13:41.370655"]]

  def edit
    @room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @room = Room.find(params[:id])
    if @room.destroy
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 4]]

  def search
      @rooms = Room.search(params[:keyword])
      @result_count = @rooms.count
---
SELECT "rooms".* FROM "rooms" WHERE (room_name LIKE '%東京%' OR content LIKE '%東京%')
SELECT COUNT(*) FROM "rooms" WHERE (address LIKE '%東京%')