app/controllers/users/registrations_controller.rb

UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ?, "self_introduction" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$12$4htVSBM7m1FTdHhfxTfAxOWHeLyirv47mdX8XB/.NTGREdFl44R0G"], ["updated_at", "2023-06-19 13:00:49.378057"], ["self_introduction", ""], ["id", 1]]
---
  def update
    binding.pry
    @user = current_user
    binding.pry
    if @user.update(params.require(:user).permit(:email, :password, :password_confirmation))